jiaguonxpcom/usb_ncdc/nCDC_RT1060/devices/MIMXRT1062/utilities/io/fsl_io.c
#if (defined DEBUG_CONSOLE_IO_FLEXCOMM) || (defined DEBUG_CONSOLE_IO_VUSART)
        case DEBUG_CONSOLE_DEVICE_TYPE_FLEXCOMM:
        case DEBUG_CONSOLE_DEVICE_TYPE_VUSART:
        {
            usart_transfer_t transfer = {0U};
            transfer.data = ch;
            transfer.dataSize = size;
            /* transfer data */
            if (tx)
            {
                status = USART_TransferSendNonBlocking(s_debugConsoleIO.ioBase, &s_ioUsartHandler, &transfer);
            }
            else
            {
                status = USART_TransferReceiveNonBlocking(s_debugConsoleIO.ioBase, &s_ioUsartHandler, &transfer, NULL);
            }
        }
        break;
#endif

#if defined DEBUG_CONSOLE_IO_SWO
        case DEBUG_CONSOLE_DEVICE_TYPE_SWO:
            status = SWO_SendBlocking((uint32_t)s_debugConsoleIO.ioBase, ch, size);
            break;
#endif
        default:
            break;
    }

    return status;
}

status_t IO_TryReceiveCharacter(uint8_t *ch)
{
    status_t status = kStatus_Fail;
    uint32_t size = 1U;

    switch (s_debugConsoleIO.ioType)
    {
#if (defined DEBUG_CONSOLE_IO_UART) || (defined DEBUG_CONSOLE_IO_IUART)
        case DEBUG_CONSOLE_DEVICE_TYPE_UART:
        case DEBUG_CONSOLE_DEVICE_TYPE_IUART:
        {
            uart_transfer_t transfer = {0U};
            transfer.data = ch;
            transfer.dataSize = size;
            if (UART_TransferGetRxRingBufferLength(&s_ioUartHandler) >= size)
            {
                /* transfer data */
                status = UART_TransferReceiveNonBlocking(s_debugConsoleIO.ioBase, &s_ioUartHandler, &transfer, NULL);
            }
        }
        break;
#endif
#if defined DEBUG_CONSOLE_IO_LPSCI
        case DEBUG_CONSOLE_DEVICE_TYPE_LPSCI:
        {
            lpsci_transfer_t transfer = {0U};
            transfer.data = ch;
            transfer.dataSize = size;
            if (LPSCI_TransferGetRxRingBufferLength(&s_ioLpsciHandler) >= size)
            {
                /* transfer data */
                status = LPSCI_TransferReceiveNonBlocking(s_debugConsoleIO.ioBase, &s_ioLpsciHandler, &transfer, NULL);
            }
        }
        break;
#endif

#if defined DEBUG_CONSOLE_IO_LPUART
        case DEBUG_CONSOLE_DEVICE_TYPE_LPUART:
        {
            lpuart_transfer_t transfer = {0U};
            transfer.data = ch;
            transfer.dataSize = size;
            if (LPUART_TransferGetRxRingBufferLength(s_debugConsoleIO.ioBase, &s_ioLpuartHandler) >= size)
            {
                /* transfer data */
                status =
                    LPUART_TransferReceiveNonBlocking(s_debugConsoleIO.ioBase, &s_ioLpuartHandler, &transfer, NULL);
            }
        }
        break;
#endif

#if defined DEBUG_CONSOLE_IO_USBCDC
        case DEBUG_CONSOLE_DEVICE_TYPE_USBCDC:
            break;
#endif

#if (defined DEBUG_CONSOLE_IO_FLEXCOMM) || (defined DEBUG_CONSOLE_IO_VUSART)
        case DEBUG_CONSOLE_DEVICE_TYPE_FLEXCOMM:
        case DEBUG_CONSOLE_DEVICE_TYPE_VUSART:
        {
            usart_transfer_t transfer = {0U};
            transfer.data = ch;
            transfer.dataSize = size;
            if (USART_TransferGetRxRingBufferLength(&s_ioUsartHandler) >= size)
            {
                /* transfer data */
                status = USART_TransferReceiveNonBlocking(s_debugConsoleIO.ioBase, &s_ioUsartHandler, &transfer, NULL);
            }
        }
        break;
#endif
        default:
            break;
    }

    return status;
}

#else

status_t IO_Transfer(uint8_t *ch, size_t size, bool tx)
{
    status_t status = kStatus_Success;
    switch (s_debugConsoleIO.ioType)
    {
#if (defined DEBUG_CONSOLE_IO_UART) || (defined DEBUG_CONSOLE_IO_IUART)
        case DEBUG_CONSOLE_DEVICE_TYPE_UART:
        case DEBUG_CONSOLE_DEVICE_TYPE_IUART:
        {
            if (tx)
            {
                UART_WriteBlocking(s_debugConsoleIO.ioBase, ch, size);
            }
            else
            {
                status = UART_ReadBlocking(s_debugConsoleIO.ioBase, ch, size);
            }
        }
        break;
#endif
#if defined DEBUG_CONSOLE_IO_LPSCI
        case DEBUG_CONSOLE_DEVICE_TYPE_LPSCI:
        {
            if (tx)
            {
                LPSCI_WriteBlocking(s_debugConsoleIO.ioBase, ch, size);
            }
            else
            {
                status = LPSCI_ReadBlocking(s_debugConsoleIO.ioBase, ch, size);
            }
        }
        break;
#endif

#if defined DEBUG_CONSOLE_IO_LPUART
        case DEBUG_CONSOLE_DEVICE_TYPE_LPUART:
        {
            if (tx)
            {
                LPUART_WriteBlocking(s_debugConsoleIO.ioBase, ch, size);
            }
            else
            {
                status = LPUART_ReadBlocking(s_debugConsoleIO.ioBase, ch, size);
            }
        }
        break;
#endif

#if defined DEBUG_CONSOLE_IO_USBCDC
        case DEBUG_CONSOLE_DEVICE_TYPE_USBCDC:
        {
            if (tx)
            {
                USB_VcomWriteBlocking(s_debugConsoleIO.ioBase, ch, size);
            }
            else
            {
                status = USB_VcomReadBlocking(s_debugConsoleIO.ioBase, ch, size);
            }
        }
        break;
#endif

#if (defined DEBUG_CONSOLE_IO_FLEXCOMM) || (defined DEBUG_CONSOLE_IO_VUSART)
        case DEBUG_CONSOLE_DEVICE_TYPE_FLEXCOMM:
        case DEBUG_CONSOLE_DEVICE_TYPE_VUSART:
        {
            if (tx)
            {
                USART_WriteBlocking(s_debugConsoleIO.ioBase, ch, size);
            }
            else
            {
                status = USART_ReadBlocking(s_debugConsoleIO.ioBase, ch, size);
            }
        }
        break;
#endif

#if defined DEBUG_CONSOLE_IO_SWO
        case DEBUG_CONSOLE_DEVICE_TYPE_SWO:
            status = SWO_SendBlocking((uint32_t)s_debugConsoleIO.ioBase, ch, size);
            break;
#endif
        default:
            status = kStatus_Fail;
            break;
    }

    return status;
}

#endif /* DEBUG_CONSOLE_TRANSFER_NON_BLOCKING */
